       IDENTIFICATION DIVISION.
       PROGRAM-ID. PEONL001.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY CUSTOMER-DTO.
       PROCEDURE DIVISION.
           EXEC CICS RECEIVE MAP('CUSMAP') END-EXEC.
           EXEC SQL SELECT NAME FROM CUSTOMER WHERE ID = :WS-ID END-EXEC.
           CALL 'PECUSLIB' USING DFHCOMMAREA.
           EXEC CICS SEND MAP('CUSMAP') END-EXEC.
           GOBACK.
