//SETTLE  JOB (DEMO),'HOST2COBOL'
//STEP01  EXEC PGM=BATCHSETTLE
//TXNIN   DD DSN=DEMO.TXN.INPUT,DISP=SHR
//ERR     DD DSN=DEMO.TXN.ERROR,DISP=(NEW,CATLG,DELETE)
